Revit 2026 API

# DocumentSavedAsEventArgs Properties

---

The DocumentSavedAsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | OriginalPath | Original path of the document. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

#### Reference

DocumentSavedAsEventArgs Class

Autodesk.Revit.DB.Events Namespace